#include"declaration.h"

//Menu类
Menu::Menu(char* pass)
{
	strcpy(password, pass);
}
Menu::Menu()
{
	strcpy(password, "12345678");//默认密码
}

bool Menu::LogIn()
{
	char input[20] = "\0";
	cout << setfill('*') << setw(50) << ' ' << endl << endl;;
	cout << setfill(' ') << setw(35) << "华清有限公司人事管理系统" << endl << endl;
	cout << setfill('*') << setw(50) << ' ' << endl;
	cout << setfill('-') << setw(50) << ' ' << endl;
	cout << setfill(' ') << setw(31) << "请输入登录密码.." << endl;
	cout << setfill('-') << setw(50) << ' ' << endl << endl << endl;
	cout << "您的输入：";
	cin >> input;
	if (strcmp(input, password) == 0) return true;
	else return false;
}
void Menu::MainMenu(char* main_option)
{
	cout << setfill(' ') << setw(26) << "*主菜单*" << endl << endl;
	cout << setfill(' ') << setw(27) << "1.读取文件" << endl;
	cout << setfill(' ') << setw(27) << "2.数据修改" << endl;
	cout << setfill(' ') << setw(27) << "3.数据新增" << endl;
	cout << setfill(' ') << setw(27) << "4.数据删除" << endl;
	cout << setfill(' ') << setw(27) << "5.修改密码" << endl;
	cout << setfill(' ') << setw(23) << "6.退出" << endl << endl;
	cout << "-------------------------------------------------" << endl;
	cout << setfill(' ') << setw(30) << "请输入序号(1-6)" << endl << endl << endl << endl;
	cout << "您的输入：";
	char input[20];
	char tmp;
	cin >> input;
	//cout << "input is:" << input << endl;
	tmp = input[0];
	//cout << "tmp is:" << tmp << endl;
	if (tmp != '1' && tmp != '2' && tmp != '3' && tmp != '4' && tmp != '5' && tmp != '6')
	{
		*main_option = '7';
	}
	else *main_option = tmp;
	cout << endl << endl << endl;
}







/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
void Menu::ReadingMode()
{
RETRY:
	cout << "                  读取文件模式                   " << endl;
	cout << "-------------------------------------------------" << endl << endl;
	cout << "              请选择你想读的文件名               " << endl << endl;
	cout << "                 1.普通员工文件                  " << endl;
	cout << "                2.管理层人员文件                 " << endl;
	cout << "               3.后勤服务人员文件                " << endl;
	cout << "                 4.外编人员文件                  " << endl;
	cout << "                     5.退出                      " << endl << endl;
	cout << "-------------------------------------------------" << endl;
	cout << setfill(' ') << setw(30) << "请输入序号(1-5)" << endl << endl << endl << endl;
	cout << "您的输入：";
	char input[20] = "\0";
	char tmpt;
	cin >> input;
	tmpt = input[0];
	if (tmpt != '1' && tmpt != '2' && tmpt != '3' && tmpt != '4' && tmpt != '5') { tmpt = '6'; }
	switch (tmpt)
	{
		///////////////////////普通员工////////////////////////////////////
	case '1':
	{
		cout << "-------------------------------------------------" << endl;
		cout << "             正为您打开普通员工文件              " << endl;
		cout << "-------------------------------------------------" << endl;
		cout << "                *请选择检索方式*                 " << endl;
		cout << "                  1.按工号检索                   " << endl;
		cout << "                   2.分类筛选                    " << endl;
		cout << "-------------------------------------------------" << endl;
		char input1[10];
		char tmp;
		cout << "您的输入: ";
		cin >> input1;
		tmp = input1[0];
		if (tmp != '1' && tmp != '2') { tmp = '3'; }
		switch (tmp)
		{
		case '1':
		{
		REDO1:
			cout << "-------------------------------------------------" << endl;
			cout << "                  工号检索模式                   " << endl;
			cout << "-------------------------------------------------" << endl;
			//相应功能的函数
			ReadingClerk(tmp);
			///////////////
			cout << "-------------------------------------------------" << endl;
			cout << "          是否继续检索？(y=Yes,else=No)          " << endl;
			cout << "-------------------------------------------------" << endl;
			char in[5];
			cout << "您的输入: ";
			cin >> in;
			char c = in[0];
			if (c == 'y') { goto REDO1; }
			else { cout << endl << endl;  goto RETRY; }
			break;
		}
		case '2':
		{
		REDO2:
			cout << "-------------------------------------------------" << endl;
			cout << "                  分类筛选模式                   " << endl;
			cout << "-------------------------------------------------" << endl;
			//相应功能的函数
			ReadingClerk(tmp);
			////////////
			cout << "-------------------------------------------------" << endl;
			cout << "          是否继续检索？(y=Yes,else=No)          " << endl;
			cout << "-------------------------------------------------" << endl;
			char in[5];
			cout << "您的输入: ";
			cin >> in;
			char c = in[0];
			if (c == 'y') { cout << endl << endl; goto REDO2; }
			else { cout << endl << endl; goto RETRY; }
			break;
		}
		default:
		{
			cout << "-------------------------------------------------" << endl;
			cout << "           输入错误，返回选择文件界面            " << endl;
			cout << "-------------------------------------------------" << endl;
			goto RETRY;
		}
		}
		break;
	}
	/// //////////////////////////////////////////////////////////////////////////
	////////////////////////////////管理层人员///////////////////////////////////
	case '2':
	{
		cout << "-------------------------------------------------" << endl;
		cout << "            正为您打开管理层人员文件             " << endl;
		cout << "-------------------------------------------------" << endl;
		cout << "                *请选择检索方式*                 " << endl;
		cout << "                  1.按工号检索                   " << endl;
		cout << "                   2.分类筛选                    " << endl;
		cout << "-------------------------------------------------" << endl;
		char input1[10];
		char tmp;
		cout << "您的输入: ";
		cin >> input1;
		tmp = input1[0];
		if (tmp != '1' && tmp != '2') { tmp = '3'; }
		switch (tmp)
		{
		case '1':
		{
		REDO3:
			cout << "-------------------------------------------------" << endl;
			cout << "                  工号检索模式                   " << endl;
			cout << "-------------------------------------------------" << endl;
			//相应功能的函数
			ReadingAdministrator(tmp);

			cout << "-------------------------------------------------" << endl;
			cout << "          是否继续检索？(y=Yes,else=No)          " << endl;
			cout << "-------------------------------------------------" << endl;
			char in[5];
			cout << "您的输入: ";
			cin >> in;
			char c = in[0];
			if (c == 'y') { goto REDO3; }
			else { cout << endl << endl;  goto RETRY; }
			break;
		}
		case '2':
		{
		REDO4:
			cout << "-------------------------------------------------" << endl;
			cout << "                  分类筛选模式                   " << endl;
			cout << "-------------------------------------------------" << endl;
			//相应功能的函数
			ReadingAdministrator(tmp);

			cout << "-------------------------------------------------" << endl;
			cout << "          是否继续检索？(y=Yes,else=No)          " << endl;
			cout << "-------------------------------------------------" << endl;
			char in[5];
			cout << "您的输入: ";
			cin >> in;
			char c = in[0];
			if (c == 'y') { cout << endl << endl; goto REDO4; }
			else { cout << endl << endl; goto RETRY; }
			break;
		}
		default:
		{
			cout << "-------------------------------------------------" << endl;
			cout << "           输入错误，返回选择文件界面            " << endl;
			cout << "-------------------------------------------------" << endl;
			goto RETRY;
		}
		}
		break;
	}
	/// //////////////////////////////////////////////////////////////////////////
	////////////////////////////////后勤服务人员///////////////////////////////////
	case '3':
	{
		cout << "-------------------------------------------------" << endl;
		cout << "           正为您打开后勤服务人员文件            " << endl;
		cout << "-------------------------------------------------" << endl;
		cout << "                *请选择检索方式*                 " << endl;
		cout << "                  1.按工号检索                   " << endl;
		cout << "                   2.分类筛选                    " << endl;
		cout << "-------------------------------------------------" << endl;
		char input1[10];
		char tmp;
		cout << "您的输入: ";
		cin >> input1;
		tmp = input1[0];
		if (tmp != '1' && tmp != '2') { tmp = '3'; }
		switch (tmp)
		{
		case '1':
		{
		REDO5:
			cout << "-------------------------------------------------" << endl;
			cout << "                  工号检索模式                   " << endl;
			cout << "-------------------------------------------------" << endl;
			//相应功能的函数
			ReadingLogistician(tmp);

			cout << "-------------------------------------------------" << endl;
			cout << "          是否继续检索？(y=Yes,else=No)          " << endl;
			cout << "-------------------------------------------------" << endl;
			char in[5];
			cout << "您的输入: ";
			cin >> in;
			char c = in[0];
			if (c == 'y') { goto REDO5; }
			else { cout << endl << endl;  goto RETRY; }
			break;
		}
		case '2':
		{
		REDO6:
			cout << "-------------------------------------------------" << endl;
			cout << "                  分类筛选模式                   " << endl;
			cout << "-------------------------------------------------" << endl;
			//相应功能的函数
			ReadingLogistician(tmp);

			cout << "-------------------------------------------------" << endl;
			cout << "          是否继续检索？(y=Yes,else=No)          " << endl;
			cout << "-------------------------------------------------" << endl;
			char in[5];
			cout << "您的输入: ";
			cin >> in;
			char c = in[0];
			if (c == 'y') { cout << endl << endl; goto REDO6; }
			else { cout << endl << endl; goto RETRY; }
			break;
		}
		default:
		{
			cout << "-------------------------------------------------" << endl;
			cout << "           输入错误，返回选择文件界面            " << endl;
			cout << "-------------------------------------------------" << endl;
			goto RETRY;
		}
		}
		break;
	}
	/// //////////////////////////////////////////////////////////////////////////
	////////////////////////////////外编人员///////////////////////////////////
	case '4':
	{
		cout << "-------------------------------------------------" << endl;
		cout << "             正为您打开外编人员文件              " << endl;
		cout << "-------------------------------------------------" << endl;
		cout << "                *请选择检索方式*                 " << endl;
		cout << "                  1.按工号检索                   " << endl;
		cout << "                   2.分类筛选                    " << endl;
		cout << "-------------------------------------------------" << endl;
		char input1[10];
		char tmp;
		cout << "您的输入: ";
		cin >> input1;
		tmp = input1[0];
		if (tmp != '1' && tmp != '2') { tmp = '3'; }
		switch (tmp)
		{
		case '1':
		{
		REDO7:
			cout << "-------------------------------------------------" << endl;
			cout << "                  工号检索模式                   " << endl;
			cout << "-------------------------------------------------" << endl;
			//相应功能的函数
			ReadingOutsider(tmp);

			cout << "-------------------------------------------------" << endl;
			cout << "          是否继续检索？(y=Yes,else=No)          " << endl;
			cout << "-------------------------------------------------" << endl;
			char in[5];
			cout << "您的输入: ";
			cin >> in;
			char c = in[0];
			if (c == 'y') { goto REDO7; }
			else { cout << endl << endl;  goto RETRY; }
			break;
		}
		case '2':
		{
		REDO8:
			cout << "-------------------------------------------------" << endl;
			cout << "                  分类筛选模式                   " << endl;
			cout << "-------------------------------------------------" << endl;
			//相应功能的函数
			ReadingOutsider(tmp);

			cout << "-------------------------------------------------" << endl;
			cout << "          是否继续检索？(y=Yes,else=No)          " << endl;
			cout << "-------------------------------------------------" << endl;
			char in[5];
			cout << "您的输入: ";
			cin >> in;
			char c = in[0];
			if (c == 'y') { cout << endl << endl; goto REDO8; }
			else { cout << endl << endl; goto RETRY; }
			break;
		}
		default:
		{
			cout << "-------------------------------------------------" << endl;
			cout << "           输入错误，返回选择文件界面            " << endl;
			cout << "-------------------------------------------------" << endl;
			goto RETRY;
		}
		}
		break;
	}/// //////////////////////////////////////////////////////////////////////////
	/////////////////////////////////////////////////////////////////////////////
	case'5':
	{
		cout << "-------------------------------------------------" << endl;
		cout << "                   返回主菜单                    " << endl;
		cout << "-------------------------------------------------" << endl << endl << endl;
		break;
	}
	default:
	{
		cout << "-------------------------------------------------" << endl;
		cout << "             输入错误，请重新输入！              " << endl;
		cout << "-------------------------------------------------" << endl << endl << endl;
		cin.sync();
		goto RETRY;
		break;
	}
	}
}
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
void Menu::WritingMode()
{
RETRY:
	cout << "                  新增数据模式                   " << endl;
	cout << "-------------------------------------------------" << endl << endl;
	cout << "              请选择你想打开的文件名              " << endl << endl;
	cout << "                 1.普通员工文件                  " << endl;
	cout << "                2.管理层人员文件                 " << endl;
	cout << "               3.后勤服务人员文件                " << endl;
	cout << "                 4.外编人员文件                  " << endl;
	cout << "                     5.退出                      " << endl << endl;
	cout << "-------------------------------------------------" << endl;
	cout << setfill(' ') << setw(30) << "请输入序号(1-5)" << endl << endl << endl << endl;
	cout << "您的输入：";
	char input[20] = "\0";
	char tmp;
	cin >> input;
	tmp = input[0];
	if (tmp != '1' && tmp != '2' && tmp != '3' && tmp != '4' && tmp != '5') { tmp = '6'; }
	switch (tmp)
	{
	case '1':
	{
		cout << "-------------------------------------------------" << endl;
		cout << "             正为您打开普通员工文件              " << endl;
		cout << "-------------------------------------------------" << endl;
	REDO1:
		//相应功能的函数
		NewClerk();
		cout << "-------------------------------------------------" << endl;
		cout << "          是否继续新增？(y=Yes,else=No)          " << endl;
		cout << "-------------------------------------------------" << endl;
		char in[5];
		cout << "您的输入: ";
		cin >> in;
		char c = in[0];
		if (c == 'y') { goto REDO1; }
		else {}
		break;
	}
	case '2':
	{
		cout << "-------------------------------------------------" << endl;
		cout << "            正为您打开管理层人员文件             " << endl;
		cout << "-------------------------------------------------" << endl;
	REDO2:
		//相应功能的函数
		NewAdministrator();
		cout << "-------------------------------------------------" << endl;
		cout << "          是否继续新增？(y=Yes,else=No)          " << endl;
		cout << "-------------------------------------------------" << endl;
		char in[5];
		cout << "您的输入: ";
		cin >> in;
		char c = in[0];
		if (c == 'y') { goto REDO2; }
		else {}
		break;
	}
	case '3':
	{
		cout << "-------------------------------------------------" << endl;
		cout << "           正为您打开后勤服务人员文件            " << endl;
		cout << "-------------------------------------------------" << endl;
	REDO3:
		//相应功能的函数
		NewLogistician();
		cout << "-------------------------------------------------" << endl;
		cout << "          是否继续新增？(y=Yes,else=No)          " << endl;
		cout << "-------------------------------------------------" << endl;
		char in[5];
		cout << "您的输入: ";
		cin >> in;
		char c = in[0];
		if (c == 'y') { goto REDO3; }
		else {}
		break;
	}
	case '4':
	{
		cout << "-------------------------------------------------" << endl;
		cout << "             正为您打开外编人员文件              " << endl;
		cout << "-------------------------------------------------" << endl;
	REDO4:
		//相应功能的函数
		NewOutsider();
		cout << "-------------------------------------------------" << endl;
		cout << "          是否继续新增？(y=Yes,else=No)          " << endl;
		cout << "-------------------------------------------------" << endl;
		char in[5];
		cout << "您的输入: ";
		cin >> in;
		char c = in[0];
		if (c == 'y') { goto REDO4; }
		else {}
		break;
	}
	case '5':
	{
		cout << "-------------------------------------------------" << endl;
		cout << "                   返回主菜单                    " << endl;
		cout << "-------------------------------------------------" << endl << endl << endl;
		break;
	}
	default:
	{
		cout << "-------------------------------------------------" << endl;
		cout << "             输入错误，请重新输入！              " << endl;
		cout << "-------------------------------------------------" << endl << endl << endl;
		cin.sync();
		goto RETRY;
		break;
	}
	}
}
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
void Menu::ModifyingMode()
{
RETRY:
	cout << "                  修改数据模式                   " << endl;
	cout << "-------------------------------------------------" << endl << endl;
	cout << "              请选择你想打开的文件名              " << endl << endl;
	cout << "                 1.普通员工文件                  " << endl;
	cout << "                2.管理层人员文件                 " << endl;
	cout << "               3.后勤服务人员文件                " << endl;
	cout << "                 4.外编人员文件                  " << endl;
	cout << "                     5.退出                      " << endl << endl;
	cout << "-------------------------------------------------" << endl;
	cout << setfill(' ') << setw(30) << "请输入序号(1-5)" << endl << endl << endl << endl;
	cout << "您的输入：";
	char input[20] = "\0";
	char tmp;
	cin >> input;
	tmp = input[0];
	if (tmp != '1' && tmp != '2' && tmp != '3' && tmp != '4' && tmp != '5') { tmp = '6'; }
	switch (tmp)
	{
	case '1':
	{
	REDO1:
		cout << "-------------------------------------------------" << endl;
		cout << "             正为您打开普通员工文件              " << endl;
		cout << "-------------------------------------------------" << endl;
		//功能函数
		ModifyClerk();

		cout << "-------------------------------------------------" << endl;
		cout << "          是否继续修改？(y=Yes,else=No)          " << endl;
		cout << "-------------------------------------------------" << endl;
		char in[5];
		cout << "您的输入: ";
		cin >> in;
		cout << endl << endl;
		char c = in[0];
		if (c == 'y') { goto REDO1; }
		break;
	}
	case '2':
	{
	REDO2:
		cout << "-------------------------------------------------" << endl;
		cout << "            正为您打开管理层人员文件             " << endl;
		cout << "-------------------------------------------------" << endl;
		//功能函数
		ModifyAdministrator();

		cout << "-------------------------------------------------" << endl;
		cout << "          是否继续修改？(y=Yes,else=No)          " << endl;
		cout << "-------------------------------------------------" << endl;
		char in[5];
		cout << "您的输入: ";
		cin >> in;
		cout << endl << endl;
		char c = in[0];
		if (c == 'y') { goto REDO2; }
		break;
	}
	case '3':
	{
	REDO3:
		cout << "-------------------------------------------------" << endl;
		cout << "           正为您打开后勤服务人员文件            " << endl;
		cout << "-------------------------------------------------" << endl;
		//功能函数
		ModifyLogistician();

		cout << "-------------------------------------------------" << endl;
		cout << "          是否继续修改？(y=Yes,else=No)          " << endl;
		cout << "-------------------------------------------------" << endl;
		char in[5];
		cout << "您的输入: ";
		cin >> in;
		cout << endl << endl;
		char c = in[0];
		if (c == 'y') { goto REDO3; }
		break;
	}
	case '4':
	{
	REDO4:
		cout << "-------------------------------------------------" << endl;
		cout << "             正为您打开外编人员文件              " << endl;
		cout << "-------------------------------------------------" << endl;
		//功能函数
		ModifyOutsider();

		cout << "-------------------------------------------------" << endl;
		cout << "          是否继续修改？(y=Yes,else=No)          " << endl;
		cout << "-------------------------------------------------" << endl;
		char in[5];
		cout << "您的输入: ";
		cin >> in;
		cout << endl << endl;
		char c = in[0];
		if (c == 'y') { goto REDO4; }
		break;
	}
	case '5':
	{
		cout << "-------------------------------------------------" << endl;
		cout << "                   返回主菜单                    " << endl;
		cout << "-------------------------------------------------" << endl << endl << endl;
		break;
	}
	default:
	{
		cout << "-------------------------------------------------" << endl;
		cout << "             输入错误，请重新输入！              " << endl;
		cout << "-------------------------------------------------" << endl << endl << endl;
		cin.sync();
		goto RETRY;
		break;
	}
	}
}
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
void Menu::DeleteMode()
{
RETRY:
	cout << "                  删除数据模式                   " << endl;
	cout << "-------------------------------------------------" << endl << endl;
	cout << "              请选择你想打开的文件名              " << endl << endl;
	cout << "                 1.普通员工文件                  " << endl;
	cout << "                2.管理层人员文件                 " << endl;
	cout << "               3.后勤服务人员文件                " << endl;
	cout << "                 4.外编人员文件                  " << endl;
	cout << "                     5.退出                      " << endl << endl;
	cout << "-------------------------------------------------" << endl;
	cout << setfill(' ') << setw(30) << "请输入序号(1-5)" << endl << endl << endl << endl;
	cout << "您的输入：";
	char input[20] = "\0";
	char tmp;
	cin >> input;
	tmp = input[0];
	if (tmp != '1' && tmp != '2' && tmp != '3' && tmp != '4' && tmp != '5') { tmp = '6'; }
	switch (tmp)
	{
	case '1':
	{
	REDO1:
		cout << "-------------------------------------------------" << endl;
		cout << "             正为您打开普通员工文件              " << endl;
		cout << "-------------------------------------------------" << endl;
		//相应功能函数
		DeleteClerk();

		cout << "-------------------------------------------------" << endl;
		cout << "          是否继续删除？(y=Yes,else=No)          " << endl;
		cout << "-------------------------------------------------" << endl;
		char in[5];
		cout << "您的输入: ";
		cin >> in;
		cout << endl << endl;
		char c = in[0];
		if (c == 'y') { goto REDO1; }
		break;
	}
	case '2':
	{
	REDO2:
		cout << "-------------------------------------------------" << endl;
		cout << "            正为您打开管理层人员文件             " << endl;
		cout << "-------------------------------------------------" << endl;
		//相应功能函数
		DeleteAdministrator();

		cout << "-------------------------------------------------" << endl;
		cout << "          是否继续删除？(y=Yes,else=No)          " << endl;
		cout << "-------------------------------------------------" << endl;
		char in[5];
		cout << "您的输入: ";
		cin >> in;
		cout << endl << endl;
		char c = in[0];
		if (c == 'y') { goto REDO2; }
		break;
	}
	case '3':
	{
	REDO3:
		cout << "-------------------------------------------------" << endl;
		cout << "           正为您打开后勤服务人员文件            " << endl;
		cout << "-------------------------------------------------" << endl;
		//相应功能函数
		DeleteLogistician();

		cout << "-------------------------------------------------" << endl;
		cout << "          是否继续删除？(y=Yes,else=No)          " << endl;
		cout << "-------------------------------------------------" << endl;
		char in[5];
		cout << "您的输入: ";
		cin >> in;
		char c = in[0];
		if (c == 'y') { goto REDO3; }
		break;
	}
	case '4':
	{
	REDO4:
		cout << "-------------------------------------------------" << endl;
		cout << "             正为您打开外编人员文件              " << endl;
		cout << "-------------------------------------------------" << endl;
		//相应功能函数
		DeleteOutsider();

		cout << "-------------------------------------------------" << endl;
		cout << "          是否继续删除？(y=Yes,else=No)          " << endl;
		cout << "-------------------------------------------------" << endl;
		char in[5];
		cout << "您的输入: ";
		cin >> in;
		cout << endl << endl;
		char c = in[0];
		if (c == 'y') { goto REDO4; }
		break;
	}
	case '5':
	{
		cout << "-------------------------------------------------" << endl;
		cout << "                   返回主菜单                    " << endl;
		cout << "-------------------------------------------------" << endl << endl << endl;
		break;
	}
	default:
	{
		cout << "-------------------------------------------------" << endl;
		cout << "             输入错误，请重新输入！              " << endl;
		cout << "-------------------------------------------------" << endl << endl << endl;
		cin.sync();
		goto RETRY;
		break;
	}
	}
}
void Menu::Exit()
{
	cout << "-------------------------------------------------" << endl;
	cout << "           退出成功，为您返回登录界面            " << endl;
	cout << "-------------------------------------------------" << endl;
}


/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
void Menu::ChangingPasswordMode()
{
	char input[20] = "\0";
	cout << "                  密码修改模式                   " << endl;
	cout << "-------------------------------------------------" << endl;
	cout << "-------------------------------------------------" << endl;
	cout << "                请先输入正确密码                 " << endl;
	cout << "-------------------------------------------------" << endl;
	cout << endl << endl;
	cout << "您的输入：";
	cin.clear();
	cin >> input;
	cout << "刚刚输入的是(" << input << ")" << endl;
	if (strcmp(input, password) == 0)
	{
		cout << endl << endl;
		cout << "-------------------------------------------------" << endl;
		cout << "           密码输入正确，请输入新密码            " << endl;
		cout << "-------------------------------------------------" << endl;
		cout << endl << endl;
		cout << "您的输入：";
		cin >> input;
		strcpy(password, input);
		cout << endl << endl;
		cout << "-------------------------------------------------" << endl;
		cout << "                 密码修改成功！                  " << endl << endl;
		cout << "您的新密码是：(" << password << ")，请牢记！" << endl;
		cout << "-------------------------------------------------" << endl;
		cout << endl;
		cout << "-------------------------------------------------" << endl;
		cout << "                 为您返回主菜单                  " << endl;
		cout << "-------------------------------------------------" << endl;
		cout << endl << endl;
	}
	else
	{
		cout << endl << endl;
		cout << "-------------------------------------------------" << endl;
		cout << "            密码输入错误，修改失败！             " << endl;
		cout << "-------------------------------------------------" << endl;
		cout << endl;
		cout << "-------------------------------------------------" << endl;
		cout << "                 为您返回主菜单                  " << endl;
		cout << "-------------------------------------------------" << endl;
		cout << endl << endl;
	}
}
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

